cfd_backend_jobs/CFD-3CDD380269/extracted/CFD-03C85BA599/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Jewlz FluidForce Simulator - Generated OpenFOAM Dictionary                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// ************************************************************************* //

convertToMeters 1;

vertices
(
    (-0.2539999961853028 -0.1269999980926514 -0.1269999980926514)
    (0.15239999771118168 -0.1269999980926514 -0.1269999980926514)
    (0.15239999771118168 0.15239999771118168 -0.1269999980926514)
    (-0.2539999961853028 0.15239999771118168 -0.1269999980926514)
    (-0.2539999961853028 -0.1269999980926514 0.15239999771118168)
    (0.15239999771118168 -0.1269999980926514 0.15239999771118168)
    (0.15239999771118168 0.15239999771118168 0.15239999771118168)
    (-0.2539999961853028 0.15239999771118168 0.15239999771118168)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 36 36) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    xMin { type patch; faces ((0 4 7 3)); }
    xMax { type patch; faces ((1 2 6 5)); }
    yMin { type patch; faces ((0 1 5 4)); }
    yMax { type patch; faces ((3 7 6 2)); }
    zMin { type patch; faces ((0 3 2 1)); }
    zMax { type patch; faces ((4 5 6 7)); }
);

mergePatchPairs
(
);
