cfd_backend_jobs/CFD-3CDD380269/extracted/CFD-03C85BA599/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| Jewlz FluidForce Simulator - Generated OpenFOAM Dictionary                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// ************************************************************************* //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-30 -0 -0);

boundaryField
{
    xMax
    {
        type fixedValue;
        value uniform (-30 -0 -0);
    }

    xMin
    {
        type zeroGradient;
    }

    yMin
    {
        type slip;
    }
    yMax
    {
        type slip;
    }
    zMin
    {
        type slip;
    }
    zMax
    {
        type slip;
    }

    object
    {
        type noSlip;
    }
}
