cfd_backend_jobs/CFD-3CDD380269/extracted/CFD-03C85BA599/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| Jewlz FluidForce Simulator - Generated OpenFOAM Dictionary                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// ************************************************************************* //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.375;

boundaryField
{
    xMax
    {
        type fixedValue;
        value uniform 3.375;
    }

    xMin
    {
        type zeroGradient;
    }

    yMin
    {
        type zeroGradient;
    }
    yMax
    {
        type zeroGradient;
    }
    zMin
    {
        type zeroGradient;
    }
    zMax
    {
        type zeroGradient;
    }

    object
    {
        type kqRWallFunction;
        value uniform 3.375;
    }
}
